---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyInvalidMember
source: html/f9eeb102-9f27-3b09-2fe2-411ec91d981c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyInvalidMember Property

Some elements became ineligible to be included in an assembly and were removed.

## Syntax (C#)
```csharp
public static FailureDefinitionId AssemblyInvalidMember { get; }
```